#-----------------------------------------------#
# DATE: 2023.07.0                              #
# AUTHOR: Maxim Datskiy                         #
# GitHub: https://github.com/immmax             #
#-----------------------------------------------#
# Курс "Поколение Python": Курс для начинающих  #
#                                               #
# Модуль 15 - Работа над мини-проектом          #
# Урок 15.6 - Калькулятор систем счисления      #
# Шаг 1-10                                      #
#-----------------------------------------------#