#-----------------------------------------------#
# DATE: 2023.07.11                              #
# AUTHOR: Maxim Datskiy                         #
# GitHub: https://github.com/immmax             #
#-----------------------------------------------#
# Курс "Поколение Python": Курс для начинающих  #
#                                               #
# Модуль 14 - Итоговая работа по функциям       #
# Урок 14.1                                     #
#                                               #
#-----------------------------------------------#

#-----------------------------------------------#
# Задача 14.1                                   #
#-----------------------------------------------#
# def draw_triangle():
#     for i in range(1, 9):
#         for j in range(0, 7+i):
#             if j < 8-i:
#                 print(' ', end='')
#             else:
#                 print('*', end='')
#         print()

# draw_triangle()

#-----------------------------------------------#
# Задача 14.2                                   #
#-----------------------------------------------#
# def get_shipping_cost(quantity):
#     return 1000 + 120 * (quantity - 1)

# print(get_shipping_cost(1))
# print(get_shipping_cost(3))

#-----------------------------------------------#
# Задача 14.3                                   #
#-----------------------------------------------#
# from math import factorial
# def compute_binom(n, k):
#     return factorial(n) // (factorial(k) * factorial(n - k))

#-----------------------------------------------#
# Задача 14.4                                   #
#-----------------------------------------------#
# digit_1 = ['один', 'два', 'три', 'четыре', 'пять', 'шесть', 'семь', 'восемь', 'девять']
# digit_2 = ['десять', 'двадцать', 'тридцать', 'сорок', 'пятьдесят',
#            'шестьдесят', 'семьдесят', 'восемьдесят', 'девяносто']
# teens = ['одиннадцать', 'двенадцать', 'тринадцать', 'четырнадцать', 'пятнадцать',
#          'шестнадцать', 'семнадцать', 'восемнадцать', 'девятнадцать']

# def number_to_words(num):
#     result = ''
#     if num < 10:
#         result = digit_1[num - 1]
#     elif 11 <= num < 20:
#         result = teens[num % 10 - 1]
#     else:
#         result = digit_2[num // 10 - 1]
#         if num % 10 != 0:
#             result += ' ' + digit_1[num % 10 - 1]
#     return result

# for i in range(1, 100):
#     print(number_to_words(i))

#-----------------------------------------------#
# Задача 14.5                                   #
#-----------------------------------------------#
# month = {
#     'ru': ['январь', 'февраль', 'март', 'апрель',
#            'май', 'июнь', 'июль', 'август',
#            'сентябрь', 'октябрь', 'ноябрь', 'декабрь'],

#     'en': ['january', 'february', 'march', 'april',
#            'may', 'june', 'july', 'august',
#            'september', 'october', 'november', 'december']
# }
# def get_month(language, number):
#     return month[language][number - 1]

# print(get_month('ru', 1))

#-----------------------------------------------#
# Задача 14.6                                   #
#-----------------------------------------------#
def is_magic(date):
    date = date.split('.')
    return int(date[0]) * int(date[1]) == int(date[2][-2:])